# Задача: используя цикл запрашивайте у пользователя число пока оно не станет больше 0, но меньше 10.
# После того, как пользователь введет корректное число, возведите его в степерь 2 и выведите на экран.
# Например, пользователь вводит число 123, вы сообщаете ему, что число не верное,
# и сообщаете об диапазоне допустимых. И просите ввести заного.
# Допустим пользователь ввел 2, оно подходит, возводим в степень 2, и выводим 4


#number = int(input("Введите число от 0 до 10")) # Просим ввести число и сразу переводим в тип - int
#while number < 0 or number > 10:
#    print ("Число не верное")
#    number = int(input("Введите число от 0 до 10")) # Просим ввести число от 0 до 10

#print ("Возводим Ваше число в квадрат", number**2) #Если число от 0 до 10, возводим его в квадрат и выдаем сообщение




# Задача-2: Исходные значения двух переменных запросить у пользователя.
# Поменять значения переменных местами. Вывести новые значения на экран.
# Решите задачу, используя только две переменные.
# Подсказки:
# * постарайтесь сделать решение через действия над числами;

#number1 = int(input("Введите первое число =")) #вводим первого число
#number2 = int(input("Введите второе число =")) #вводим второе число

#number1 = number1 + number2 #создаем сумму чисел
#number2 = number1 - number2 #из суммы вычитаем второе число получаем, измененное первое
#number1 = number1 - number2 #из суммы вычитает число из предыдущей строки, получаем измененное второе

#print ("Первое число = ", number1) #Выводим первую переменную
#print ("Второе число = ", number2) #Выводим вторую переменную


