#Lessons 1

# Задача-1: поработайте с переменными, создайте несколько,
# выведите на экран, запросите от пользователя и сохраните в переменную, выведите на экран

#a = 5
#b = 7
#print(a + b)

#c = int(input("Введите число с"))

#print("Вы ввели число:", c)

# Задача-2: Запросите от пользователя число, сохраните в переменную,
# прибавьте к числу 2 и выведите результат на экран.
# Если возникла ошибка, прочитайте ее, вспомните урок и постарайтесь устранить ошибку.

#a = int(input("Введите число"))
#a = a + 2
#print(a)

# Задача-3: Запросите у пользователя его возраст.
# Если ему есть 18 лет, выведите: "Доступ разрешен",
# иначе "Извините, пользование данным ресурсом только с 18 лет"

#v= int(input("введите свой возраст"))
#if v >= 18:
#    print ("Доступ разрешен")
#else:
#    print("Извините, пользование данным ресурсом только с 18 лет")
